In [3]:
import pandas as pd

### Series Data Structure

In [3]:
#This will generate the documentation
pd.Series?

In [6]:
x = pd.Series([1,2,3])
x

0    1
1    2
2    3
dtype: int64

In [9]:
y = pd.Series(['1','2',None])
y

0       1
1       2
2    None
dtype: object

In [11]:
z = pd.Series([1,2,None])
z

0    1.0
1    2.0
2    NaN
dtype: float64

In [2]:
import numpy as np

In [16]:
np.nan

nan

In [17]:
np.nan == np.nan

False

In [19]:
np.isnan(np.nan)

True

In [20]:
z.iloc[1]

2.0

In [24]:
y.loc[1] # here the index column label has to be given

'2'

In [34]:
%%timeit -n 100
s = pd.Series(np.random.randint(0,1000,100000))
(np.sum(s))
# the 100 in timeit specifies it will run this 100 times and average out the result

100 loops, best of 3: 1.04 ms per loop

In [35]:
%%timeit -n 100
ss = pd.Series(np.random.randint(0,1000,100000))
sum = 0
for i in ss:
    sum += i
(sum)

100 loops, best of 3: 5.77 ms per loop

In [26]:
series_1 = pd.Series({"name":"aman","age":"24","gender":"male"})
series_2 = pd.Series({"name":"aman2","age":"224","gender":"male"})
series_1.iloc[0]

'24'

In [15]:
df = pd.DataFrame([series_1,series_2])

In [18]:
df.iloc[0]

age         24
gender    male
name      aman
Name: 0, dtype: object

In [24]:
df.loc[0]

age         24
gender    male
name      aman
Name: 0, dtype: object

In [28]:
df.loc[0,'name']

'aman'

In [29]:
df.T

           0      1
age       24    224
gender  male   male
name    aman  aman2

In [32]:
df.T.loc['age']

0     24
1    224
Name: age, dtype: object

In [34]:
df.loc[:]

   age gender   name
0   24   male   aman
1  224   male  aman2

In [35]:
df.loc[:,['name']]

    name
0   aman
1  aman2

In [36]:
df.drop(0)

   age gender   name
1  224   male  aman2

In [37]:
df

   age gender   name
0   24   male   aman
1  224   male  aman2

In [41]:
newdf = pd.DataFrame([series_1,series_2],index=('entry 1','entry 2'))
newdf

         age gender   name
entry 1   24   male   aman
entry 2  224   male  aman2

In [43]:
newdf.drop?

In [44]:
newdf?

In [45]:
df.columns

Index([u'age', u'gender', u'name'], dtype='object')

age       True
gender    True
name      True
dtype: bool